Hello Alexng, Still i'm facing this issue in OCI provider as well with terraform version 0.13.1.

`
terraform -v
Terraform v0.13.1
+ provider registry.terraform.io/hashicorp/oci v3.90.1

========================================
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.oci_file_storage_export_sets.export_sets will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_export_sets" "export_sets"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvaqvz3b4gtd43ovqeu4nsnsz6cuzauk6kspmhz4qdbue2mnbka"
      ~ export_sets         = [
          - {
              - availability_domain = "WrnJ:PHX-AD-1"
              - compartment_id      = "ocid1.compartment.oc1..aaaaaaaarl"
              - display_name        = "phxl1-mount_target-data-001 - export set"
              - id                  = "ocid1.exportset.oc1.phx.aaaaaaa"
              - max_fs_stat_bytes   = ""
              - max_fs_stat_files   = ""
              - mount_target_id     = ""
              - state               = "ACTIVE"
              - time_created        = "2020-08-27 07:22:11.259 +0000 UTC"
              - vcn_id              = "ocid1.vcn.oc1.phx.amaaaaabva"
            },
          - {
              - availability_domain = "WrnJ:PHX-AD-1"
              - compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvaqvka"
              - display_name        = "phxl1-dbbackend-001"
              - id                  = "ocid1.exportset.oc1.phx.aaazaaaaa"
              - max_fs_stat_bytes   = ""
              - max_fs_stat_files   = ""
              - mount_target_id     = ""
              - state               = "ACTIVE"
              - time_created        = "2020-08-27 07:21:32.584 +0000 UTC"
              - vcn_id              = "ocid1.vcn.oc1.phx.amaaaabva"
            },
        ] -> (known after apply)
      - id                  = "2020-08-27 07:40:59.286727 +0000 UTC" -> null
    }

  # data.oci_file_storage_file_systems.fss will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_file_systems" "fss"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvaqvz3b4gtd43oka"
        file_systems        = [
            {
                availability_domain = "WrnJ:PHX-AD-1"
                compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvaqbka"
                defined_tags        = {
                    "Oracle-Tags.CreatedBy" = "emailid"
                    "Oracle-Tags.CreatedOn" = "2020-08-27T07:21:32.063Z"
                }
                display_name        = "phxl1-filesystem-dbbackend-001"
                freeform_tags       = {
                    "Environment"     = "Lab"
                    "Purpose"         = "Terraform"
                    "Region_function" = "Primary"
                }
                id                  = "ocid1.filesystem.oc1.phx.aaaaaaaazaaaaa"
                kms_key_id          = ""
                metered_bytes       = "0"
                state               = "ACTIVE"
                time_created        = "2020-08-27 07:21:32.067 +0000 UTC"
            },
        ]
      ~ id                  = "2020-08-27 07:40:54.78267 +0000 UTC" -> "2020-08-27 07:41:01.913177 +0000 UTC"
    }

  # data.oci_file_storage_mount_targets.mount_targets will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_mount_targets" "mount_targets"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvaqvz3b4g2mnbka"
      ~ id                  = "2020-08-27 07:40:58.563307 +0000 UTC" -> "2020-08-27 07:41:01.973742 +0000 UTC"
        mount_targets       = [
            {
                availability_domain = "WrnJ:PHX-AD-1"
                compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvaqvz3ka"
                defined_tags        = {
                    "Oracle-Tags.CreatedBy" = "email"
                    "Oracle-Tags.CreatedOn" = "2020-08-27T07:22:11.175Z"
                }
                display_name        = "phxl1-mount_target-data-001"
                export_set_id       = "ocid1.exportset.oc1.phx.aaaaaa4aa"
                freeform_tags       = {
                    "Environment"     = "Lab"
                    "Purpose"         = "Terraform"
                    "Region_function" = "Primary"
                }
                hostname_label      = ""
                id                  = "ocid1.mounttarget.oc1.phx.aaaaaa4naa"
                ip_address          = ""
                lifecycle_details   = ""
                nsg_ids             = [
                    "ocid1.networksecuritygroup.oc1.phx.aaaaaaymkq",
                ]
                private_ip_ids      = [
                    "ocid1.privateip.oc1.phx.aaaaaaaagemhlsknpwya",
                ]
                state               = "ACTIVE"
                subnet_id           = "ocid1.subnet.oc1.phx.aaaaaashzwaelna"
                time_created        = "2020-08-27 07:22:11.259 +0000 UTC"
            },
            {
                availability_domain = "WrnJ:PHX-AD-1"
                compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlvabka"
                defined_tags        = {
                    "Oracle-Tags.CreatedBy" = "email"
                    "Oracle-Tags.CreatedOn" = "2020-08-27T07:21:32.537Z"
                }
                display_name        = "phxl1-mount_target-control-001"
                export_set_id       = "ocid1.exportset.oc1.phx.afuzaaaaa"
                freeform_tags       = {
                    "Environment"     = "Lab"
                    "Purpose"         = "Terraform"
                    "Region_function" = "Primary"
                }
                hostname_label      = ""
                id                  = "ocid1.mounttarget.oc1.phx.aaaaaa4zaaaaa"
                ip_address          = ""
                lifecycle_details   = ""
                nsg_ids             = [
                    "ocid1.networksecuritygroup.oc1.phx.aaaaaaaat2zj2rymkq",
                ]
                private_ip_ids      = [
                    "ocid1.privateip.oc1.phx.aaaaaaaaqp6limr2b6lra",
                ]
                state               = "ACTIVE"
                subnet_id           = "ocid1.subnet.oc1.phx.aaaaaaaadm2qq"
                time_created        = "2020-08-27 07:21:32.584 +0000 UTC"
            },
        ]
    }

  # module.export["phxl1-dbbackend-001"].oci_file_storage_export.export[0] must be replaced
-/+ resource "oci_file_storage_export" "export" {
      ~ export_set_id  = "ocid1.exportset.oc1.phx.aaaaaaaaa" -> (known after apply) # forces replacement
        file_system_id = "ocid1.filesystem.oc1.phx.aaaaaaaaaa2ylefuzaaaaa"
      ~ id             = "ocid1.export.oc1.phx.aaaaacylefuzaaaaa" -> (known after apply)
        path           = "/phxl1-dbbackend-001"
      ~ state          = "ACTIVE" -> (known after apply)
      ~ time_created   = "2020-08-27 07:22:25.572 +0000 UTC" -> (known after apply)

        export_options {
            access                         = "READ_WRITE"
            anonymous_gid                  = "65534"
            anonymous_uid                  = "65534"
            identity_squash                = "NONE"
            require_privileged_source_port = false
            source                         = "10.XXX.104.0/24"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - export_sets_id = {
      - phxl1-dbbackend-001                      = "ocid1.exportset.oc1.phx.aaaaaa4naa"
      - phxl1-mount_target-data-001 - export set = "ocid1.exportset.oc1.phx.aaaaaaaaa"
    } -> null

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
`